In [60]:
import numpy as np
import pandas as pd

In [61]:
df = pd.read_csv('cars.csv')

In [62]:
df.sample(5)

        brand  km_driven    fuel         owner  selling_price
4225   Maruti       5621  Petrol   First Owner         650000
1302     Tata      86000  Diesel  Second Owner         521000
1720   Toyota      25538  Petrol   First Owner         625000
2447   Maruti      70000  Petrol  Second Owner         150000
6261  Hyundai       9400  Petrol   First Owner         721000

In [63]:
df['brand'].value_counts()

brand
Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: count, dtype: int64

In [64]:
df['fuel'].value_counts()

fuel
Diesel    4402
Petrol    3631
CNG         57
LPG         38
Name: count, dtype: int64

In [65]:
pd.get_dummies(df, columns=['fuel', 'owner'], dtype=int)

,brand,km_driven,selling_price,fuel_CNG,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_First Owner,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,0,1,0,0,1,0,0,0,0
1,Skoda,120000,370000,0,1,0,0,0,0,1,0,0
2,Honda,140000,158000,0,0,0,1,0,0,0,0,1
3,Hyundai,127000,225000,0,1,0,0,1,0,0,0,0
4,Maruti,120000,130000,0,0,0,1,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,0,0,0,1,1,0,0,0,0
8124,Hyundai,119000,135000,0,1,0,0,0,1,0,0,0
8125,Maruti,120000,382000,0,1,0,0,1,0,0,0,0
8126,Tata,25000,290000,0,1,0,0,1,0,0,0,0
8127,Tata,25000,290000,0,1,0,0,1,0,0,0,0

In [66]:
df['owner'].value_counts()

owner
First Owner             5289
Second Owner            2105
Third Owner              555
Fourth & Above Owner     174
Test Drive Car             5
Name: count, dtype: int64

In [67]:
pd.get_dummies(df, columns=['fuel', 'owner'], drop_first=True)

,brand,km_driven,selling_price,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,True,False,False,False,False,False,False
1,Skoda,120000,370000,True,False,False,False,True,False,False
2,Honda,140000,158000,False,False,True,False,False,False,True
3,Hyundai,127000,225000,True,False,False,False,False,False,False
4,Maruti,120000,130000,False,False,True,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,False,False,True,False,False,False,False
8124,Hyundai,119000,135000,True,False,False,True,False,False,False
8125,Maruti,120000,382000,True,False,False,False,False,False,False
8126,Tata,25000,290000,True,False,False,False,False,False,False
8127,Tata,25000,290000,True,False,False,False,False,False,False

In [68]:
df.sample(5)

       brand  km_driven    fuel         owner  selling_price
5735    Tata     120000  Diesel   First Owner         225000
5781    Tata      24000  Diesel  Second Owner         350000
5085  Jaguar      45000  Diesel   First Owner        3200000
748     Tata      50000  Diesel   First Owner         360000
2568  Maruti      20000  Petrol   First Owner         310000

In [69]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(df.iloc[:, 0:4], df.iloc[:, -1], test_size=0.2)

In [70]:
x_train.sample(5)

        brand  km_driven    fuel         owner
2594  Hyundai      60000  Diesel   First Owner
1880    Skoda     202000  Diesel   First Owner
5391   Maruti      38000  Petrol  Second Owner
6163   Datsun       1300  Petrol   First Owner
2233   Maruti      40000  Petrol  Second Owner

In [74]:
from sklearn.preprocessing import OneHotEncoder

ohe = OneHotEncoder(drop='first', sparse_output=False)
x_train_new = ohe.fit_transform(x_train[['fuel', 'owner']])

In [75]:
x_train_new

array([[0., 0., 1., ..., 0., 0., 0.],
       [0., 0., 1., ..., 1., 0., 0.],
       [0., 0., 1., ..., 0., 0., 0.],
       ...,
       [0., 0., 1., ..., 0., 0., 0.],
       [1., 0., 0., ..., 0., 0., 0.],
       [0., 0., 1., ..., 0., 0., 0.]])

In [80]:
x_test_new = ohe.transform(x_test[['fuel', 'owner']])
x_train_new.shape

(6502, 7)

In [84]:
np.hstack((x_train[['brand', 'km_driven']].values, x_train_new))

array([['Hyundai', 38000, 0.0, ..., 0.0, 0.0, 0.0],
       ['Tata', 25000, 0.0, ..., 1.0, 0.0, 0.0],
       ['Honda', 35000, 0.0, ..., 0.0, 0.0, 0.0],
       ...,
       ['Hyundai', 20000, 0.0, ..., 0.0, 0.0, 0.0],
       ['Ford', 80000, 1.0, ..., 0.0, 0.0, 0.0],
       ['Renault', 6500, 0.0, ..., 0.0, 0.0, 0.0]], dtype=object)

In [86]:
counts = df['brand'].value_counts()
repl = counts[counts <= 100].index

In [105]:
pd.get_dummies(df['brand'].replace(repl, 'uncommon'), dtype=int).sample(5)

,BMW,Chevrolet,Ford,Honda,Hyundai,Mahindra,Maruti,Renault,Skoda,Tata,Toyota,Volkswagen,uncommon
2987,0,0,0,0,0,0,1,0,0,0,0,0,0
5149,0,0,0,0,1,0,0,0,0,0,0,0,0
3050,0,0,0,0,0,0,1,0,0,0,0,0,0
1872,1,0,0,0,0,0,0,0,0,0,0,0,0
4560,0,0,0,0,0,0,1,0,0,0,0,0,0